Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: a UV illuminator (110) embedded in the air gasper knob, oriented to transmit UV illumination through the UV transparent material to sanitize exterior surfaces of the gasper knob, the UV illuminator comprising a strip of light emitting diodes, LEDs, oriented to emit UV illumination toward the second annular end face of the gasper knob; and further comprising a valve assembly (114) configured to open and close a flow of air by turning the gasper knob about an axis of rotation, wherein the first annular end face of the gasper knob is at an inlet end (116) of the gasper knob mounted to the valve assembly, and wherein the second annular end face of the gasper knob is at an outlet end of the gasper knob extending away from the nozzle assembly; and wherein
de_de: eine UV-Beleuchtungseinrichtung (110), die in den Frischluftleitungsknopf eingebettet ist und ausgerichtet ist, um UV-Beleuchtung durch das UV-durchlässige Material zu übertragen, um die Außenflächen des Frischluftleitungsknopfes zu desinfizieren, die UV-Beleuchtungseinrichtung einen Streifen Leuchtdioden (LEDs) umfassend, die ausgerichtet sind, um UV-Beleuchtung in Richtung der zweiten ringförmigen Endfläche des Frischluftleitungsknopfs zu emittieren; und ferner umfassend eine Ventilbaugruppe (114), die konfiguriert ist, um einen Luftstrom durch Drehen des Frischluftleitungsknopfs um eine Drehachse zu öffnen und zu schließen, wobei sich die erste ringförmige Endfläche des Frischluftleitungsknopfs an einem Einlassende (116) des an der Ventilbaugruppe angebrachten Frischluftleitungsknopf befindet und wobei sich die zweite ringförmige Endfläche des Frischluftleitungsknopfs an einem Auslassende des Frischluftleitungsknopfs befindet, das sich von der Düsenbaugruppe weg erstreckt; und wobei

source: the PSU system further comprising at least one reading light (126) and/or at least one flight attendant call button (128) mounted in a PSU panel (130) with the valve assembly, wherein the at least one reading light and/or at least one flight attendant call button are electrically connected to a source of electrical power, and wherein the strip of LEDs is electrically connected to the source of electrical power.
de_de: das PSU-System ferner mindestens eine Leselampe (126) und/oder mindestens eine Flugbegleiter-Ruftaste (128) umfasst, die in einem PSU-Panel (130) mit der Ventilbaugruppe angebracht sind, wobei die mindestens eine Leselampe und/oder mindestens eine Flugbegleiter-Ruftaste elektrisch mit einer Stromquelle verbunden sind und wobei der Streifen LEDs elektrisch mit der Stromquelle verbunden ist.

source: 2. The system as recited in claim 1, wherein the strip of LEDs is annular and is embedded in the gasper knob proximate to the first annular end face of the gasper knob.
de_de: 2. System nach Anspruch 1, wobei der Streifen LEDs ringförmig ist und in den Frischluftleitungsknopf in der Nähe der ersten ringförmigen Endfläche des Frischluftleitungsknopf eingebettet ist.

source: 3. The system as recited in claim 1 or 2, wherein the valve assembly includes a central cone (120) configured to engage and disengage a rim (122) in the valve assembly by turning of the gasper knob to control air flow through the gasper knob from a pressurized air source in fluid communication with the valve assembly.
de_de: 3. System nach Anspruch 1 oder 2, wobei die Ventilbaugruppe einen zentralen Kegel (120) beinhaltet, der konfiguriert ist, um durch Drehen des Frischluftleitungsknopfs in einen Rand (122) in der Ventilbaugruppe einzukuppeln und auszukuppeln, um den Luftstrom durch den Frischluftleitungsknopf von einer Druckluftquelle, die in Fluidverbindung mit der Ventilbaugruppe ist, zu kontrollieren.

source: 4. The system as recited in any preceding claim, wherein the gasper knob is one of a plurality of gasper knobs each having a respective illuminator electrically connected to the source of electrical power.
de_de: 4. System nach einem der vorhergehenden Ansprüche, wobei der Frischluftleitungsknopf einer von einer Vielzahl von Frischluftleitungsknöpfen ist, die jeweils über eine entsprechende Beleuchtungseinrichtung verfügen, die elektrisch mit der Stromquelle verbunden ist.

source: 5. A method of sanitizing an overhead Passenger Service Unit system according to claim 1, the method comprising:
de_de: 5. Verfahren zum Desinfizieren eines Überkopf-Passagierservicesystem nach Anspruch 1, das Verfahren umfassend:

source: illuminating the annular air gasper knob (102) of the overhead PSU (10) using UV illumination to destroy infectious agents on surfaces of the gasper knob.
de_de: Beleuchten des ringförmigen Frischluftleitungsknopfs (102) der Überkopf-PSU (10) mittels UV-Beleuchtung, um Infektionserreger auf den Oberflächen des Frischluftleitungsknopfs zu zerstören.

source: 6. The method as recited in claim 5, wherein illuminating includes illuminating all exposed surfaces of the gasper knob.
de_de: 6. Verfahren nach Anspruch 5, wobei das Beleuchten das Beleuchten aller freiliegenden Oberflächen des Frischluftleitungsknopfs beinhaltet.

source: 7. The method as recited in claim 5 or 6, further comprising illuminating the UV illuminator after passengers have disembarked the aircraft cabin.
de_de: 7. Verfahren nach Anspruch 5 oder 6, ferner umfassend das Beleuchten der UV-Beleuchtungseinrichtung, nachdem die Passagiere die Flugzeugkabine verlassen haben.

source: 8. The method as recited in claim 7, further comprising deactivating the illuminator prior to passengers boarding the aircraft cabin.
de_de: 8. Verfahren nach Anspruch 7, ferner umfassend das Deaktivieren der Beleuchtungseinrichtung vor dem Betreten der Flugzeugkabine durch die Passagiere.

source: 1. A blade angle feedback ring assembly (200) for an aircraft propeller (130) rotatable about a longitudinal axis (A) and having an adjustable blade angle, the assembly (200) comprising:
de_de: 1. Blattwinkelrückmeldungsringbaugruppe (200) für einen Luftfahrzeugpropeller (130), der um eine Längsachse (A) drehbar ist und einen justierbaren Blattwinkel aufweist, wobei die Baugruppe (200) Folgendes umfasst:

source: a feedback ring (204) having a plurality of position markers (202) provided thereon;
de_de: einen Rückmeldungsring (204) mit einer Vielzahl von darauf bereitgestellten Positionsmarkierungen (202);

source: at least one sensor (212) positioned proximate the feedback ring (204), wherein one of the feedback ring (204) and the at least one sensor (212) is configured to be mounted for rotation with the propeller (130) and to move along the longitudinal axis (A) with adjustment of the blade angle relative to the other of the feedback ring (204) and the at least one sensor (212), and the at least one sensor (212) is configured to detect, as the one of the feedback ring (204) and the at least one sensor (212) rotates, relative passage of the plurality of position markers (202); and
de_de: mindestens einen Sensor (212), der in der Nähe des Rückmeldungsrings (204) positioniert ist, wobei entweder der Rückmeldungsring (204) oder der mindestens eine Sensor (212) konfiguriert ist, um zur Drehung mit dem Propeller (130) montiert zu sein und sich entlang der Längsachse (A) zu bewegen, wobei der Blattwinkel relativ zu dem anderen von dem Rückkopplungsring (204) und mindestens einem Sensor (212) eingestellt wird, und der mindestens eine Sensor (212) konfiguriert ist, um, wenn sich entweder der Rückkopplungsring (204) oder der mindestens eine Sensor (212) dreht, relativen Durchgang der Vielzahl von Positionsmarkierungen (202) zu erkennen; und

source: at least one shielding element configured to be provided between the feedback ring (204) and the propeller (130), the at least one shielding element configured to shield the feedback ring (204) from electromagnetism,
de_de: mindestens ein Abschirmelement, das konfiguriert ist, um zwischen dem Rückmeldungsring (204) und dem Propeller (130) bereitgestellt zu sein, wobei das mindestens eine Abschirmelement konfiguriert ist, um den Rückmeldungsring (204) vor Elektromagnetismus abzuschirmen,

source: characterised in that the at least one shielding element comprises:
de_de: dadurch gekennzeichnet, dass das mindestens eine Abschirmelement Folgendes umfasst:

source: a non-conductive material as a barrier in the feedback ring (204);
de_de: ein nichtleitendes Material als Barriere in dem Rückmeldungsring (204);

source: a layer of insulator coating provided on the feedback ring (204) or on the at least one sensor (212) for increasing a dielectric resistance of an air gap between the feedback ring (204) and the at least one sensor (212); or
de_de: eine auf dem Rückkopplungsring (204) oder auf dem mindestens einen Sensor (212) bereitgestellte Isolierbeschichtungsschicht zum Erhöhen eines dielektrischen Widerstands eines Luftspalts zwischen dem Rückmeldungsring (204) und dem mindestens einen Sensor (212); oder

source: a coating applied on a root surface (304) of the feedback ring (204), the coating made of a magnetic field blocking nano-plating, Mu metal, electrical steel, stainless solenoid or ferrite ceramics, wherein the feedback ring (204) has first and second opposing faces (302), and defines the root surface (304) that extends and circumscribes the first and second opposing faces (302), the feedback ring (204) comprising the plurality of position markers (202) spaced around a circumference thereof and oriented at an angle relative to one another and relative to the longitudinal axis (A), the plurality of position markers (202) extending away from the root surface (304).
de_de: eine auf eine Wurzeloberfläche (304) des Rückmeldungsrings (204) aufgetragene Beschichtung, wobei die Beschichtung aus einer magnetfeldblockierenden Nanobeschichtung, Mu-Metall, Elektrostahl, rostfreiem Solenoid oder Ferritkeramik hergestellt ist, wobei der Rückmeldungsring (204) erste und zweite gegenüberliegende Flächen (302) aufweist und die Wurzeloberfläche (304) definiert, die sich über die erste und zweite gegenüberliegende Fläche (302) erstreckt und diese begrenzt, wobei der Rückmeldungsring (204) die Vielzahl von Positionsmarkierungen (202) umfasst, die um seinen Umfang herum beabstandet und in einem Winkel relativ zueinander und relativ zur Längsachse (A) ausgerichtet sind, wobei sich die Vielzahl von Positionsmarkierungen (202) von der Wurzeloberfläche (304) weg erstreckt.

source: 2. The feedback ring assembly (200) of claim 1, wherein the feedback ring (204) is configured to be mounted for rotation with the propeller (130) and to move along the longitudinal axis (A) with adjustment of the blade angle, and the at least one sensor (212) is configured to detect passage of the plurality of position markers (202) as the feedback ring (204) rotates.
de_de: 2. Rückmeldungsringbaugruppe (200) nach Anspruch 1, wobei der Rückmeldungsring (204) konfiguriert ist, um zur Drehung mit dem Propeller (130) montiert zu sein und sich bei Einstellung des Blattwinkels entlang der Längsachse (A) zu bewegen, und der mindestens eine Sensor (212) konfiguriert ist, um Durchgang der Vielzahl von Positionsmarkierungen (202) zu erkennen, wenn sich der Rückmeldungsring (204) dreht.

source: 3. The feedback ring assembly (200) of claim 2, further comprising a plurality of rods (306) coupled to the feedback ring (204) and extending along a direction substantially parallel to the longitudinal axis (A), the plurality of rods (306) configured to support the feedback ring (204) for longitudinal sliding movement along the longitudinal axis (A) with adjustment of the blade angle.
de_de: 3. Rückmeldungsringbaugruppe (200) nach Anspruch 2, die ferner eine Vielzahl von Stangen (306) umfasst, die mit dem Rückmeldungsring (204) verbunden sind und sich entlang einer Richtung erstrecken, die im Wesentlichen parallel zur Längsachse (A) ist, wobei die Vielzahl von Stangen (306) konfiguriert ist, um den Rückmeldungsring (204) für eine Längsgleitbewegung entlang der Längsachse (A) bei Einstellung des Blattwinkels zu stützen.

source: 4. The feedback ring assembly (200) of claim 3, wherein the at least one shielding element comprises the plurality of rods (306) being made from a non-conductive material.
de_de: 4. Rückmeldungsringbaugruppe (200) nach Anspruch 3, wobei das mindestens eine Abschirmelement die Vielzahl von Stangen (306) umfasst, die aus einem nichtleitenden Material hergestellt sind.

source: 5. The feedback ring assembly (200) of claim 3 or 4, wherein the feedback ring (204) comprises a plurality of threaded inserts (502) spaced around a circumference of the feedback ring (204) and each configured to receive therein a given one of the plurality of rods (306), the at least one shielding element comprising the plurality of threaded inserts (502) being made from a non-conductive material.
de_de: 5. Rückmeldungsringbaugruppe (200) nach Anspruch 3 oder 4, wobei der Rückmeldungsring (204) eine Vielzahl von Gewindeeinsätzen (502) umfasst, die um einen Umfang des Rückmeldungsrings (204) herum angeordnet sind und jeweils konfiguriert sind, um darin eine bestimmte Stange der Vielzahl von Stangen (306) aufzunehmen, wobei das mindestens eine die Vielzahl von Gewindeeinsätzen (502) umfassende Abschirmelement aus einem nichtleitenden Material hergestellt ist.

source: 6. The feedback ring assembly (200) of claim 5, wherein the plurality of threaded inserts (502) are made from a ceramic material.
de_de: 6. Rückmeldungsringbaugruppe (200) nach Anspruch 5, wobei die Vielzahl von Gewindeeinsätzen (502) aus einem Keramikmaterial hergestellt ist.

source: 7. The feedback ring assembly (200) of any of claims 3 to 6, wherein the feedback ring (204) comprises the plurality of position markers (202) spaced around a circumference thereof and oriented at an angle relative to one another and relative to the longitudinal axis (A), the feedback ring (204) further comprising a metallic inner ring (702) configured to receive the plurality of rods (306) therein and an outer ring (704) configured to encapsulate the plurality of position markers (202), the at least one shielding element comprising the outer ring (704) being made from a non-conductive material.
de_de: 7. Rückmeldungsringbaugruppe (200) nach einem der Ansprüche 3 bis 6, wobei der Rückmeldungsring (204) die Vielzahl von Positionsmarkierungen (202) umfasst, die um seinen Umfang herum beabstandet und in einem Winkel relativ zueinander und relativ zu der Längsachse (A) ausgerichtet sind, der Rückmeldungsring (204) ferner einen metallischen Innenring (702) umfasst, der konfiguriert ist, um die Vielzahl von Stangen (306) darin aufzunehmen, und einen Außenring (704) umfasst, der konfiguriert ist, um die Vielzahl von Positionsmarkierungen (202) einzukapseln, wobei das mindestens eine den Außenring (704) umfassende Abschirmelement aus einem nichtleitenden Material hergestellt ist.

source: 8. The feedback ring assembly (200) of claim 7, wherein the outer ring (704) is made from a non-conductive polymer.
de_de: 8. Rückmeldungsringbaugruppe (200) nach Anspruch 7, wobei der Außenring (704) aus einem nichtleitenden Polymer hergestellt ist.

source: 9. The feedback ring assembly (200) of any of claims 3 to 6, wherein the feedback ring (204) comprises the plurality of position markers (202) spaced around a circumference thereof and oriented at an angle relative to one another and relative to the longitudinal axis (A), the feedback ring (204) further comprising a metallic inner ring (804) configured to receive the plurality of rods (306) therein and a metallic outer ring (806) configured to support the plurality of position markers (202) thereon, the at least one shielding element comprising a separating layer disposed between the inner ring (804) and the outer ring (806), the separating layer made from a non-conductive material.
de_de: 9. Rückmeldungsringbaugruppe (200) nach einem der Ansprüche 3 bis 6, wobei der Rückmeldungsring (204) die Vielzahl von Positionsmarkierungen (202) umfasst, die um seinen Umfang herum beabstandet und in einem Winkel relativ zueinander und relativ zu der Längsachse (A) ausgerichtet sind, der Rückmeldungsring (204) ferner einen metallischen Innenring (804) umfasst, der konfiguriert ist, um die Vielzahl von Stangen (306) darin aufzunehmen, und einen metallischen Außenring (806) umfasst, der konfiguriert ist, um die Vielzahl von Positionsmarkierungen (202) darauf zu stützen, wobei das mindestens eine Abschirmelement eine Trennschicht, die zwischen dem Innenring (804) und dem Außenring (806) angeordnet ist, umfasst, wobei die Trennschicht aus einem nichtleitenden Material hergestellt ist.

source: The feedback ring assembly (200) of any preceding claim, wherein the at least one shielding element comprises the feedback ring (204) being made from a non-conductive material.
de_de: Rückmeldungsringbaugruppe (200) nach einem der vorhergehenden Ansprüche, wobei das mindestens eine Abschirmelement den Rückmeldungsring (204) umfasst, der aus einem nichtleitenden Material hergestellt ist.

source: The feedback ring assembly (200) of claim 10, wherein the feedback ring (204) is made from a non-conductive polymer.
de_de: Rückmeldungsringbaugruppe (200) nach Anspruch 10, wobei der Rückmeldungsring (204) aus einem nichtleitenden Polymer hergestellt ist.

source: The feedback ring assembly (200) of any preceding claim, wherein the at least one shielding element comprises the feedback ring (204) being made from Mu metal, electrical steel, stainless solenoid or ferrite ceramics.
de_de: Rückmeldungsringbaugruppe (200) nach einem der vorhergehenden Ansprüche, wobei das mindestens eine Abschirmelement den Rückmeldungsring (204) umfasst, der aus Mu-Metall, Elektrostahl, rostfreiem Solenoid oder Ferritkeramik hergestellt ist.

source: An aircraft propeller system comprising:
de_de: Luftfahrzeugpropellersystem, umfassend:

source: a propeller (130) rotatable about a longitudinal axis (A) and having blades (310) with adjustable blade angle; and
de_de: einen Propeller (130), der um eine Längsachse (A) drehbar ist und Blätter (310) mit einstellbarem Blattwinkel aufweist; und

source: the feedback ring assembly (200) according to any preceding claim.
de_de: die Rückmeldungsringbaugruppe (200) nach einem der vorhergehenden Ansprüche.

source: 1. A fuel injector (64) for a turbine engine (20), comprising:
de_de: 1. Einspritzdüse (64) für ein Turbinentriebwerk, umfassend:

source: a fuel nozzle (80) comprising a gallery (98), a plurality of feed passages (100) and a plurality of exit passages (102);
de_de: eine Brennstoffdüse (80), die einen Kanal (98), eine Vielzahl von Zufuhrdurchgängen (100) und eine Vielzahl von Auslassdurchgängen (102) umfasst;

source: the gallery (98) extending within the fuel nozzle (80) circumferentially around an axis (106) between a first end (116) of the gallery (98) and a second end (118) of the gallery (98), a size of the gallery (98) changing as the gallery (98) extends circumferentially around the axis (106) between the first end (116) of the gallery (98) and the second end (118) of the gallery (98);
de_de: wobei sich der Kanal (98) innerhalb der Brennstoffdüse (80) in Umfangsrichtung um eine Achse (106) zwischen einem ersten Ende (116) des Kanals (98) und einem zweiten Ende (118) des Kanals (98) erstreckt, wobei sich die Größe des Kanals (98) ändert, während sich der Kanal (98) in Umfangsrichtung um die Achse (106) zwischen dem ersten Ende (116) des Kanals (98) und dem zweiten Ende (118) des Kanals (98) erstreckt;

source: the plurality of feed passages (100) extending within the fuel nozzle (80) to the gallery (98), and the plurality of feed passages (100) configured to supply fuel to the gallery (98);
de_de: die Vielzahl von Zufuhrdurchgängen (100), die sich innerhalb der Brennstoffdüse (80) zu dem Kanal (98) erstreckt, und die Vielzahl von Zufuhrdurchgängen (100), die konfiguriert ist, um dem Kanal (98) Brennstoff zuzuführen;

source: the plurality of exit passages (102) extending within the fuel nozzle (80) from the gallery (98), and the plurality of exit passages (102) configured to receive the fuel from the gallery (98); and
de_de: wobei sich die Vielzahl von Auslassdurchgängen (102) innerhalb der Brennstoffdüse (80) von dem Kanal (98) erstreckt und die Vielzahl von Auslassdurchgänge (102) konfiguriert ist, um Brennstoff aus dem Kanal (98) aufzunehmen; und

source: the plurality of feed passages (100) being fluidly coupled to the gallery (98) at the first end (116) of the gallery (98).
de_de: die Vielzahl von Zufuhrdurchgängen (100) an dem ersten Ende (116) des Kanals (98) mit dem Kanal (98) fluidgekoppelt ist.

source: 2. The fuel injector (64) of claim 1, wherein an axial length (122) of the gallery (98) changes as the gallery (98) extends circumferentially around the axis (106) between the first end (116) of the gallery (98) and the second end (118) of the gallery (98).
de_de: 2. Einspritzdüse (64) nach Anspruch 1, wobei sich eine axiale Länge (122) des Kanals (98) ändert, während sich der Kanal (98) in Umfangsrichtung um die Achse (106) zwischen dem ersten Ende (116) des Kanals (98) und dem zweiten Ende (118) des Kanals (98) erstreckt.

source: 3. The fuel injector (64) of claim 1 or 2, wherein a radial width (124) of the gallery (98) changes as the gallery (98) extends circumferentially around the axis (106) between the first end (116) of the gallery (98) and the second end (118) of the gallery (98).
de_de: 3. Einspritzdüse (64) nach Anspruch 1 oder 2, wobei sich eine radiale Breite (124) des Kanals (98) ändert, während sich der Kanal (98) in Umfangsrichtung um die Achse (106) zwischen dem ersten Ende (116) des Kanals (98) und dem zweiten Ende (118) des Kanals (98) erstreckt.

source: 4. The fuel injector (64) of any preceding claim, wherein a cross-sectional area of the gallery (98) changes as the gallery (98) extends circumferentially around the axis (106) between the first end (116) of the gallery (98) and the second end (118) of the gallery (98).
de_de: 4. Einspritzdüse (64) nach einem der vorhergehenden Ansprüche, wobei sich eine Querschnittsfläche des Kanals (98) ändert, während sich der Kanal (98) in Umfangsrichtung um die Achse (106) zwischen dem ersten Ende (116) des Kanals (98) und dem zweiten Ende (118) des Kanals (98) erstreckt.

source: 5. The fuel injector (64) of any preceding claim, wherein the size of the gallery (98) decreases as the gallery (98) extends circumferentially around the axis (106) from the first end (116) of the gallery (98) to the second end (118) of the gallery (98).
de_de: 5. Einspritzdüse (64) nach einem der vorhergehenden Ansprüche, wobei sich die Größe des Kanals (98) verringert, während sich der Kanal (98) in Umfangsrichtung um die Achse (106) von dem ersten Ende (116) des Kanals (98) zu dem zweiten Ende (118) des Kanals (98) erstreckt.

source: 6. The fuel injector (64) of any preceding claim, wherein
de_de: 6. Einspritzdüse (64) nach einem der vorhergehenden Ansprüche, wobei

source: the plurality of feed passages (100) comprise a first feed passage (100A) that is fluidly coupled with the gallery (98) at a first feed passage orifice (128A);
de_de: die Vielzahl von Zufuhrdurchgängen (100) einen ersten Zufuhrdurchgang (100A) umfasst, der an einer ersten Zufuhrdurchgangsmündung (128A) mit dem Kanal (98) fluidgekoppelt ist;

source: the plurality of exit passages (102) comprise a first exit passage (102A) that is fluidly coupled with the gallery (98) at a first exit passage orifice (134A); and
de_de: die Vielzahl von Auslassdurchgängen (102) einen ersten Auslassdurchgang (102A) umfasst, der an einer ersten Auslassdurchgangsmündung (134A) mit dem Kanal (98) fluidgekoppelt ist; und
